Revit 2024 API
ScheduleField.GetName Method
 Gets the name of the field.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string GetName()
Visual Basic
Public Function GetName As String
Visual C++
public:
String^ GetName()
Return Value
 The name of the field.
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace